2023-05-20-allwinner-v85x-boot0-note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Lu Hui" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgcbd85b3" class="outline-2">
<h2 id="orgcbd85b3">allwinner v85x boot0 note</h2>
<div class="outline-text-2" id="text-orgcbd85b3">
</div>
<div id="outline-container-org400b132" class="outline-3">
<h3 id="org400b132">source</h3>
<div class="outline-text-3" id="text-org400b132">
<p>
<a href="https://github.com/lindenis-org/lindenis-v853-lichee-brandy-2.0-spl-pub">https://github.com/lindenis-org/lindenis-v853-lichee-brandy-2.0-spl-pub</a>
</p>
</div>
</div>

<div id="outline-container-orgf1c1b18" class="outline-3">
<h3 id="orgf1c1b18">remake checksum</h3>
<div class="outline-text-3" id="text-orgf1c1b18">
<p>
you need remake checksum, after modify image.
</p>

<p>
<a href="https://github.com/nminaylov/F1C100s_projects/blob/master/tools/mksunxi/mksunxi.c">https://github.com/nminaylov/F1C100s_projects/blob/master/tools/mksunxi/mksunxi.c</a>
</p>
</div>
</div>

<div id="outline-container-org94da48c" class="outline-3">
<h3 id="org94da48c">boot0_header layout</h3>
<div class="outline-text-3" id="text-org94da48c">
<p>
reference:
</p>

<p>
<a href="https://github.com/lindenis-org/lindenis-v853-lichee-brandy-2.0-spl-pub/blob/master/include/private_boot0.h">https://github.com/lindenis-org/lindenis-v853-lichee-brandy-2.0-spl-pub/blob/master/include/private_boot0.h</a>
</p>

<p>
allwinner have some tools use for modify this:
</p>

<p>
<a href="https://github.com/lindenis-org/lindenis-v853-tools">https://github.com/lindenis-org/lindenis-v853-tools</a>
</p>
</div>
</div>

<div id="outline-container-orgd163cf7" class="outline-3">
<h3 id="orgd163cf7">nboot boot from sdcard</h3>
<div class="outline-text-3" id="text-orgd163cf7">
<p>
some opensource reference:
</p>

<p>
boot0 load boot-package:
</p>

<p>
<a href="https://github.com/lindenis-org/lindenis-v853-lichee-brandy-2.0-spl-pub/blob/d36b228278e654d7d7bfa2f5f777311b6d9dc61b/nboot/main/boot0_main.c#LL101C15-L101C15">https://github.com/lindenis-org/lindenis-v853-lichee-brandy-2.0-spl-pub/blob/d36b228278e654d7d7bfa2f5f777311b6d9dc61b/nboot/main/boot0_main.c#LL101C15-L101C15</a>
</p>

<p>
boot0 load_package() function source code:
</p>

<p>
<a href="https://github.com/szemzoa/sun8iw20_spl/blob/aedc18e734ecc71262fb64f962f485a12e56981c/nboot/load_image_mmc/load_image_sdmmc.c#L157">https://github.com/szemzoa/sun8iw20_spl/blob/aedc18e734ecc71262fb64f962f485a12e56981c/nboot/load_image_mmc/load_image_sdmmc.c#L157</a>
</p>

<p>
boot0 load_toc1_from_sdmmc() function source code:
</p>

<p>
<a href="https://github.com/szemzoa/sun8iw20_spl/blob/aedc18e734ecc71262fb64f962f485a12e56981c/nboot/load_image_mmc/load_image_sdmmc.c#LL113C4-L113C4">https://github.com/szemzoa/sun8iw20_spl/blob/aedc18e734ecc71262fb64f962f485a12e56981c/nboot/load_image_mmc/load_image_sdmmc.c#LL113C4-L113C4</a>
</p>

<p>
v85x will load boot-package from this offset in sdcard:
</p>

<p>
<a href="https://github.com/lindenis-org/lindenis-v853-lichee-brandy-2.0-spl-pub/blob/d36b228278e654d7d7bfa2f5f777311b6d9dc61b/include/spare_head.h#L64">https://github.com/lindenis-org/lindenis-v853-lichee-brandy-2.0-spl-pub/blob/d36b228278e654d7d7bfa2f5f777311b6d9dc61b/include/spare_head.h#L64</a>
</p>

<p>
toc1 header struct:
</p>

<p>
<a href="https://github.com/szemzoa/sun8iw20_spl/blob/aedc18e734ecc71262fb64f962f485a12e56981c/nboot/load_image_mmc/load_image_sdmmc.c#LL119C9-L119C9">https://github.com/szemzoa/sun8iw20_spl/blob/aedc18e734ecc71262fb64f962f485a12e56981c/nboot/load_image_mmc/load_image_sdmmc.c#LL119C9-L119C9</a>
</p>

<p>
<a href="https://github.com/lindenis-org/lindenis-v853-lichee-brandy-2.0-spl-pub/blob/d36b228278e654d7d7bfa2f5f777311b6d9dc61b/include/private_toc.h#L58">https://github.com/lindenis-org/lindenis-v853-lichee-brandy-2.0-spl-pub/blob/d36b228278e654d7d7bfa2f5f777311b6d9dc61b/include/private_toc.h#L58</a>
</p>

<p>
boot0 load_image() function source code:
</p>

<p>
<a href="https://github.com/szemzoa/sun8iw20_spl/blob/aedc18e734ecc71262fb64f962f485a12e56981c/nboot/main/load_image.c#L31">https://github.com/szemzoa/sun8iw20_spl/blob/aedc18e734ecc71262fb64f962f485a12e56981c/nboot/main/load_image.c#L31</a>
</p>

<p>
how to make toc1:
</p>

<p>
<a href="https://linux-sunxi.org/Allwinner_Nezha#BSP_boot0_SPL">https://linux-sunxi.org/Allwinner_Nezha#BSP_boot0_SPL</a>
</p>

<p>
<a href="https://fedoraproject.org/wiki/Architectures/RISC-V/Allwinner/zh-cn#%E5%88%9B%E5%BB%BA_u-boot.toc1">https://fedoraproject.org/wiki/Architectures/RISC-V/Allwinner/zh-cn#%E5%88%9B%E5%BB%BA_u-boot.toc1</a>
</p>

<p>
<a href="https://github.com/smaeul/u-boot/blob/d1-wip/tools/sunxi_toc1.c">https://github.com/smaeul/u-boot/blob/d1-wip/tools/sunxi_toc1.c</a>
</p>

<p>
I make a project, use buildroot generate bootable v85x bootimage:
</p>

<p>
<a href="https://github.com/newluhux/buildroot_aw_v85x">https://github.com/newluhux/buildroot_aw_v85x</a>
</p>
</div>
</div>

<div id="outline-container-org6f52473" class="outline-3">
<h3 id="org6f52473">some error message rev eng</h3>
<div class="outline-text-3" id="text-org6f52473">
</div>
<div id="outline-container-orge9fda6f" class="outline-4">
<h4 id="orge9fda6f">function check_hardware_info()</h4>
<div class="outline-text-4" id="text-orge9fda6f">
<div class="org-src-container">
<pre class="src src-c"><code>/* check sysctl, allwinner sucks, no register guide for this*/</code>
<code>/* check allwinner sid */</code>
<code>if (read32(0x030060a0) == 0) {</code>
<code>        if (read(0x03006200 &amp; 0xFFFF) != 0) {</code>
<code>                pr_emerg("bootinfo error1\n");</code>
<code>                return 1;</code>
<code>        }</code>
<code>}</code>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last updated: 2023-06-07</p>
</div>
</body>
</html>